DasGuptaPapadimitriouVazirani.org
#+TITLE: Solution Manual For Algorithms by Das Gupta Papadimitriou and Vazirani
#+AUTHOR: Sidharth Arya
#+LATEX_CLASS: some
#+LATEX: \frontmatter
#+OPTIONS: toc:nil
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="style.css"/>
#+TOC: headlines 0
* Prologue
**  
   - f = \Theta(g)
     
   Since =n-100= and =n-200= have the same power of n.
   - f = O(g)
   
   Since n^{1/2} is smaller than n^{2/3}
   - f = \Theta(g)
   
   Since =log n= can always be overcome by =n= above a particular =n=,  and so can it be less than =log n= below a particular =n=. 
   - f = \Theta(g)
   
   Since 
#+BEGIN_EQUATION
10n log 10n 
= 10n(log 10 + log n)
= 10n log 10 + 10n log n
= \theta (nlogn)
#+END_EQUATION 
   - f = \Theta(g)
   
   Since log 2n = log 2 + log n and log 3n = log 3 + log n. which makes log 2 and log 3, just constants.
   - f = \Theta (g)

   Since log n^2 = 2log n. and 2 is just a constant that can be dropped.
   - f = \Omega(g)
   
   Since power greater than 0 can always overtake log at some point
   - f = \Omega(g)
   
   On comparing n^2 is greater than n, and log's are not that signifincant in comparison.
   - f = \Omega(g)
   
   Since power greater than 0 can always overtake log at some point
   - f = \Omega(g)
   
   Since (log n)^{(log n) -1} is greater than n for some value of n.
#+BEGIN_EQUATION
Let us simplify equation for better comparison. We can multiply the equations by log n

Giving

f'(x) = (log n)^{(log n) + 1}

g'(x) =  n

I am using ' since equations have been altered and not the same as they initially were, yet they are still comparable.

now applying log

f''(x) = (1+log n) log (log n)

g''(x) = log n

It is clear that it may not be possible to draw a direct relation. But f''(x) can be written as:

f''(x) = (1 + g''(x)) log (g''(x))

Now, if we visualize, log g''(x) will produce 1 at some point and will keep increasing after that value, and at that point it is multiplied by 1+ g''(x) which will clearly compound to something greater than g''(x) itself.

Therefore, at some point f(x) will overtake g(x)
#+END_EQUATION
  - f = \Omega(g)
  
  Since power greater than 0 can always overtake log at some point
  - f = O(g)

#+BEGIN_EQUATION
5^{log_2 n} = 5^{log_2 n x log_5 5} = 5^{log_5 n x log_2 5} = (5^{log_5 n})^{log_2 5} = n^{log_2 5} \approx n^2.something
#+END_EQUATION

Therefore, at some n g will overcome f, by comparison of powers.
  - f = \Omega(g)

  Since n2^n will produce a greater value for n than 3^n at some point.
  - f = \Theta(g)

  Since the two differ by a constant multiplicative factor, i.e. 2.
  - f = \Theta(g)

#+BEGIN_EQUATION
Expansion of n!

n! = n(n-1)(n-2)..1

Notice that largest possible power of n will be n. if we count unity as (n-something)

Therefore n! can be dependent on n^n

and so n^n at some point will definetely overcome 2^n.

n! grows atleast as fast as 2^n, maybe more, but our concern is satisfied.
#+END_EQUATION
  - f=O(g)
#+BEGIN_EQUATION
Taking log on both equations, and comparing

f'(x) = log n x log(log n)

g'(x) = (log_2 n)^2 x log 2 = log 2 x (log_2 e)^2 x log n x log n

Comparing the n-dependent terms, log n is certainly greater than log(log n). Therefore, g'(x) will be greater than f'(x) at some point.
#+END_EQUATION
** 
   g(n) = 1 + c + c^2 ... + c^n
   - if c < 1 
     
   The series will be decreasing. so the maximum number will be 1. Therefore, g(n) be independent of n, on approximation, implying g(n) = \Theta(1).
   - if c = 1
   
   g(n) = 1 + 1 +1 +... + 1 = n
   
   Therefore, g(n) = \Theta(n)
   - if c> 1
   
   g(n) will be increasing. The largest term will be c^n
   
   Therefore, g(n) = \Theta(c^n)
