DasGuptaPapadimitriouVazirani.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-10-05 Fri 21:20 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Solution Manual For Algorithms by Das Gupta Papadimitriou and Vazirani</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Sidharth Arya" />
<link rel="stylesheet" type="text/css" href="style.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Solution Manual For Algorithms by Das Gupta Papadimitriou and Vazirani</h1>
<div id="outline-container-orgc24b31d" class="outline-2">
<h2 id="orgc24b31d"><span class="section-number-2">1</span> Prologue</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org81f8996" class="outline-3">
<h3 id="org81f8996"><span class="section-number-3">1.1</span> </h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>f = &Theta;(g)</li>
</ul>

<p>
Since <code>n-100</code> and <code>n-200</code> have the same power of n.
</p>
<ul class="org-ul">
<li>f = O(g)</li>
</ul>

<p>
Since n<sup>1/2</sup> is smaller than n<sup>2/3</sup>
</p>
<ul class="org-ul">
<li>f = &Theta;(g)</li>
</ul>

<p>
Since <code>log n</code> can always be overcome by <code>n</code> above a particular <code>n</code>,  and so can it be less than <code>log n</code> below a particular <code>n</code>. 
</p>
<ul class="org-ul">
<li>f = &Theta;(g)</li>
</ul>

<p>
Since 
</p>
<div class="EQUATION">
<p>
10n log 10n 
= 10n(log 10 + log n)
= 10n log 10 + 10n log n
= &theta; (nlogn)
</p>

</div>
<ul class="org-ul">
<li>f = &Theta;(g)</li>
</ul>

<p>
Since log 2n = log 2 + log n and log 3n = log 3 + log n. which makes log 2 and log 3, just constants.
</p>
<ul class="org-ul">
<li>f = &Theta; (g)</li>
</ul>

<p>
Since log n<sup>2</sup> = 2log n. and 2 is just a constant that can be dropped.
</p>
<ul class="org-ul">
<li>f = &Omega;(g)</li>
</ul>

<p>
Since power greater than 0 can always overtake log at some point
</p>
<ul class="org-ul">
<li>f = &Omega;(g)</li>
</ul>

<p>
On comparing n<sup>2</sup> is greater than n, and log's are not that signifincant in comparison.
</p>
<ul class="org-ul">
<li>f = &Omega;(g)</li>
</ul>

<p>
Since power greater than 0 can always overtake log at some point
</p>
<ul class="org-ul">
<li>f = &Omega;(g)</li>
</ul>

<p>
Since (log n)<sup>(log n) -1</sup> is greater than n for some value of n.
</p>
<div class="EQUATION">
<p>
Let us simplify equation for better comparison. We can multiply the equations by log n
</p>

<p>
Giving
</p>

<p>
f'(x) = (log n)<sup>(log n) + 1</sup>
</p>

<p>
g'(x) =  n
</p>

<p>
I am using ' since equations have been altered and not the same as they initially were, yet they are still comparable.
</p>

<p>
now applying log
</p>

<p>
f''(x) = (1+log n) log (log n)
</p>

<p>
g''(x) = log n
</p>

<p>
It is clear that it may not be possible to draw a direct relation. But f''(x) can be written as:
</p>

<p>
f''(x) = (1 + g''(x)) log (g''(x))
</p>

<p>
Now, if we visualize, log g''(x) will produce 1 at some point and will keep increasing after that value, and at that point it is multiplied by 1+ g''(x) which will clearly compound to something greater than g''(x) itself.
</p>

<p>
Therefore, at some point f(x) will overtake g(x)
</p>

</div>
<ul class="org-ul">
<li>f = &Omega;(g)</li>
</ul>

<p>
Since power greater than 0 can always overtake log at some point
</p>
<ul class="org-ul">
<li>f = O(g)</li>
</ul>

<div class="EQUATION">
<p>
5<sup>log<sub>2</sub> n</sup> = 5<sup>log<sub>2</sub> n x log<sub>5</sub> 5</sup> = 5<sup>log<sub>5</sub> n x log<sub>2</sub> 5</sup> = (5<sup>log<sub>5</sub> n</sup>)<sup>log<sub>2</sub> 5</sup> = n<sup>log<sub>2</sub> 5</sup> &asymp; n<sup>2.something</sup>
</p>

</div>

<p>
Therefore, at some n g will overcome f, by comparison of powers.
</p>
<ul class="org-ul">
<li>f = &Omega;(g)</li>
</ul>

<p>
Since n2<sup>n</sup> will produce a greater value for n than 3<sup>n</sup> at some point.
</p>
<ul class="org-ul">
<li>f = &Theta;(g)</li>
</ul>

<p>
Since the two differ by a constant multiplicative factor, i.e. 2.
</p>
<ul class="org-ul">
<li>f = &Theta;(g)</li>
</ul>

<div class="EQUATION">
<p>
Expansion of n!
</p>

<p>
n! = n(n-1)(n-2)..1
</p>

<p>
Notice that largest possible power of n will be n. if we count unity as (n-something)
</p>

<p>
Therefore n! can be dependent on n<sup>n</sup>
</p>

<p>
and so n<sup>n</sup> at some point will definetely overcome 2<sup>n</sup>.
</p>

<p>
n! grows atleast as fast as 2<sup>n</sup>, maybe more, but our concern is satisfied.
</p>

</div>
<ul class="org-ul">
<li>f=O(g)</li>
</ul>
<div class="EQUATION">
<p>
Taking log on both equations, and comparing
</p>

<p>
f'(x) = log n x log(log n)
</p>

<p>
g'(x) = (log<sub>2</sub> n)<sup>2</sup> x log 2 = log 2 x (log<sub>2</sub> e)<sup>2</sup> x log n x log n
</p>

<p>
Comparing the n-dependent terms, log n is certainly greater than log(log n). Therefore, g'(x) will be greater than f'(x) at some point.
</p>

</div>
</div>
</div>
<div id="outline-container-org7a0c124" class="outline-3">
<h3 id="org7a0c124"><span class="section-number-3">1.2</span> </h3>
<div class="outline-text-3" id="text-1-2">
<p>
g(n) = 1 + c + c<sup>2</sup> &#x2026; + c<sup>n</sup>
</p>
<ul class="org-ul">
<li>if c &lt; 1</li>
</ul>

<p>
The series will be decreasing. so the maximum number will be 1. Therefore, g(n) be independent of n, on approximation, implying g(n) = &Theta;(1).
</p>
<ul class="org-ul">
<li>if c = 1</li>
</ul>

<p>
g(n) = 1 + 1 +1 +&#x2026; + 1 = n
</p>

<p>
Therefore, g(n) = &Theta;(n)
</p>
<ul class="org-ul">
<li>if c&gt; 1</li>
</ul>

<p>
g(n) will be increasing. The largest term will be c<sup>n</sup>
</p>

<p>
Therefore, g(n) = &Theta;(c<sup>n</sup>)
</p>
</div>
</div>
