DasGuptaPapadimitriouVazirani.tex
% Created 2018-10-05 Fri 21:20
% Intended LaTeX compiler: pdflatex
\documentclass{book}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Sidharth Arya}
\date{\today}
\title{Solution Manual For Algorithms by Das Gupta Papadimitriou and Vazirani}
\hypersetup{
 pdfauthor={Sidharth Arya},
 pdftitle={Solution Manual For Algorithms by Das Gupta Papadimitriou and Vazirani},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.0.50 (Org mode 9.1.14)}, 
 pdflang={English}}
\begin{document}

\maketitle
\frontmatter
\setcounter{tocdepth}{0}
\tableofcontents
\chapter{Prologue}
\label{sec:orgdfc9ed9}
\section{}
\label{sec:orge073fc5}
\begin{itemize}
\item f = \(\Theta\)(g)
\end{itemize}

Since \texttt{n-100} and \texttt{n-200} have the same power of n.
\begin{itemize}
\item f = O(g)
\end{itemize}

Since n\(^{\text{1/2}}\) is smaller than n\(^{\text{2/3}}\)
\begin{itemize}
\item f = \(\Theta\)(g)
\end{itemize}

Since \texttt{log n} can always be overcome by \texttt{n} above a particular \texttt{n},  and so can it be less than \texttt{log n} below a particular \texttt{n}. 
\begin{itemize}
\item f = \(\Theta\)(g)
\end{itemize}

Since 
\begin{EQUATION}
10n log 10n 
= 10n(log 10 + log n)
= 10n log 10 + 10n log n
= \(\theta\) (nlogn)
\end{EQUATION}
\begin{itemize}
\item f = \(\Theta\)(g)
\end{itemize}

Since log 2n = log 2 + log n and log 3n = log 3 + log n. which makes log 2 and log 3, just constants.
\begin{itemize}
\item f = \(\Theta\) (g)
\end{itemize}

Since log n\(^{\text{2}}\) = 2log n. and 2 is just a constant that can be dropped.
\begin{itemize}
\item f = \(\Omega\)(g)
\end{itemize}

Since power greater than 0 can always overtake log at some point
\begin{itemize}
\item f = \(\Omega\)(g)
\end{itemize}

On comparing n\(^{\text{2}}\) is greater than n, and log's are not that signifincant in comparison.
\begin{itemize}
\item f = \(\Omega\)(g)
\end{itemize}

Since power greater than 0 can always overtake log at some point
\begin{itemize}
\item f = \(\Omega\)(g)
\end{itemize}

Since (log n)\(^{\text{(log n) -1}}\) is greater than n for some value of n.
\begin{EQUATION}
Let us simplify equation for better comparison. We can multiply the equations by log n

Giving

f'(x) = (log n)\(^{\text{(log n) + 1}}\)

g'(x) =  n

I am using ' since equations have been altered and not the same as they initially were, yet they are still comparable.

now applying log

f''(x) = (1+log n) log (log n)

g''(x) = log n

It is clear that it may not be possible to draw a direct relation. But f''(x) can be written as:

f''(x) = (1 + g''(x)) log (g''(x))

Now, if we visualize, log g''(x) will produce 1 at some point and will keep increasing after that value, and at that point it is multiplied by 1+ g''(x) which will clearly compound to something greater than g''(x) itself.

Therefore, at some point f(x) will overtake g(x)
\end{EQUATION}
\begin{itemize}
\item f = \(\Omega\)(g)
\end{itemize}

Since power greater than 0 can always overtake log at some point
\begin{itemize}
\item f = O(g)
\end{itemize}

\begin{EQUATION}
5\(^{\text{log}_{\text{2}} \ \text{n}}\) = 5\(^{\text{log}_{\text{2}} \ \text{n x log}_{\text{5}} \ \text{5}}\) = 5\(^{\text{log}_{\text{5}} \ \text{n x log}_{\text{2}} \ \text{5}}\) = (5\(^{\text{log}_{\text{5}} \ \text{n}}\))\(^{\text{log}_{\text{2}} \ \text{5}}\) = n\(^{\text{log}_{\text{2}} \ \text{5}}\) \(\approx\) n\(^{\text{2.something}}\)
\end{EQUATION}

Therefore, at some n g will overcome f, by comparison of powers.
\begin{itemize}
\item f = \(\Omega\)(g)
\end{itemize}

Since n2\(^{\text{n}}\) will produce a greater value for n than 3\(^{\text{n}}\) at some point.
\begin{itemize}
\item f = \(\Theta\)(g)
\end{itemize}

Since the two differ by a constant multiplicative factor, i.e. 2.
\begin{itemize}
\item f = \(\Theta\)(g)
\end{itemize}

\begin{EQUATION}
Expansion of n!

n! = n(n-1)(n-2)..1

Notice that largest possible power of n will be n. if we count unity as (n-something)

Therefore n! can be dependent on n\(^{\text{n}}\)

and so n\(^{\text{n}}\) at some point will definetely overcome 2\(^{\text{n}}\).

n! grows atleast as fast as 2\(^{\text{n}}\), maybe more, but our concern is satisfied.
\end{EQUATION}
\begin{itemize}
\item f=O(g)
\end{itemize}
\begin{EQUATION}
Taking log on both equations, and comparing

f'(x) = log n x log(log n)

g'(x) = (log\(_{\text{2}}\) n)\(^{\text{2}}\) x log 2 = log 2 x (log\(_{\text{2}}\) e)\(^{\text{2}}\) x log n x log n

Comparing the n-dependent terms, log n is certainly greater than log(log n). Therefore, g'(x) will be greater than f'(x) at some point.
\end{EQUATION}
\section{}
\label{sec:orgf24fd30}
g(n) = 1 + c + c\(^{\text{2}}\) \ldots{} + c\(^{\text{n}}\)
\begin{itemize}
\item if c < 1
\end{itemize}

The series will be decreasing. so the maximum number will be 1. Therefore, g(n) be independent of n, on approximation, implying g(n) = \(\Theta\)(1).
\begin{itemize}
\item if c = 1
\end{itemize}

g(n) = 1 + 1 +1 +\ldots{} + 1 = n

Therefore, g(n) = \(\Theta\)(n)
\begin{itemize}
\item if c> 1
\end{itemize}

g(n) will be increasing. The largest term will be c\(^{\text{n}}\)

Therefore, g(n) = \(\Theta\)(c\(^{\text{n}}\))
