DasGuptaPapadimitriouVazirani.html
<div id="outline-container-org7a20a80" class="outline-3">
<h3 id="org7a20a80"><span class="section-number-3">1.3</span> </h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li></li>
</ul>
<div class="EQUATION">
<p>
F<sub>n</sub> &ge; 2<sup>0.5n</sup> for n &ge; 6
</p>

<p>
<b>Induction</b>
</p>

<p>
Case : n = 6 (Base Case)
</p>

<p>
F<sub>0</sub> = 0, F<sub>1</sub> = 1 , F<sub>2</sub> = 1, F<sub>3</sub> = 2, F<sub>4</sub> = 3, F<sub>5</sub> = 5
</p>

<p>
L.H.S : F<sub>6</sub> = F<sub>5</sub> + F<sub>4</sub> = 8
</p>

<p>
R.H.S : 2<sup>0.5 x 6</sup> = 8
</p>

<p>
Since L.H.S = R.H.S
</p>

<p>
This case is true.
</p>

<p>
Let it be true, for n = k.
</p>

<p>
F<sub>k</sub> = F<sub>k-1</sub>+ F<sub>k-2</sub> &ge; 2<sup>0.5 x k</sup>
</p>

<p>
Case: n = k+1
</p>

<p>
F<sub>k+1</sub> = F<sub>k</sub> + F<sub>k-1</sub> &ge; 2<sup>0.5 x k</sup> + 2<sup>0.5 x k-1</sup>  = 2<sup>0.5 k</sup> (1+2<sup>-0.5</sup>) 
</p>

<p>
It can easily be shown that 1+ 2<sup>-0.5</sup> &gt; 2<sup>0.5</sup>
</p>

<p>
Subsituting that instead
F<sub>k+1</sub> &ge; 2<sup>0.5(k+1)</sup>
</p>

</div>
<ul class="org-ul">
<li></li>
</ul>
<div class="EQUATION">
<p>
We need to solve for c such that:
</p>

<p>
F<sub>n</sub> &le; 2<sup>cm</sup> &forall; n &ge; 6
</p>

<p>
&rArr; F<sub>n-1</sub> + F<sub>n-2</sub> &le; 2<sup>cn</sup>
</p>

<p>
&rArr; 2<sup>c(n-1)</sup> + 2<sup>c(n-2)</sup> &le; 2<sup>cn</sup>
</p>

<p>
&rArr; 2<sup>c(n-2)</sup> (2<sup>c</sup> + 1) &le; 2<sup>cn</sup>
</p>

<p>
&rArr; 2<sup>c</sup> +1  &le; 2<sup>2c</sup>
</p>

<p>
Let 2<sup>c</sup> =x
</p>

<p>
&rArr; x +1 &le; x<sup>2</sup>
</p>

<p>
&rArr; x<sup>2</sup> - x - 1 &ge; 0
</p>

<p>
2<sup>c</sup> &ge; \(\frac{1 \pm \sqrt{5}}{2}\) 
</p>

<p>
Taking log
</p>

<p>
&rArr; c  &ge; log<sub>2</sub> (1 &plusmn; \(\sqrt{5}\)) - 1
</p>

<p>
c &asymp; 1.694
</p>

</div>

<ul class="org-ul">
<li></li>
</ul>
<p>
From previous example . c = 1.694
</p>
</div>
</div>

<div id="outline-container-org3867554" class="outline-3">
<h3 id="org3867554"><span class="section-number-3">1.4</span> </h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>Basic Matrix multiplication</li>
<li>If we attribute all multiplicative and additive operations as O(1), then,
If we have to compute fibonnacci of, say 9.
We already know the value of matrix X. So to find value of fibonnacci 9, we need to know X<sup>9</sup>, which can be written as X<sup>8</sup> x X. Since we already know the value of X. All we have to do is compute X<sup>2</sup> = X x X and X<sup>4</sup> = X*2 x X<sup>2</sup> and X<sup>8</sup> = X<sup>4</sup> x X<sup>4</sup>, which gives us a total of 3 matrix multiplication operations. for n = 9.</li>
</ul>
<p>
And for n = 8 it would be the same. Since log 8 is 3, so there are 3 matrix multiplication. which concludes the answer.
</p>
<ul class="org-ul">
<li>It's an obvious statement, since even the final answer will not be n bits long.</li>
</ul>
<p>
let's say we start with 0, 1, 1. The third fibonnacci number in binary will be 10.  compare them with n= 0, 1,2,3. Just for sake of argument let's use induction.
</p>
<div class="EQUATION">
<p>
<b>Induction</b>
</p>

<p>
for n = 1 (Base Case)
</p>

<p>
F<sub>1</sub> = 1
</p>

<p>
also in binary only one bit is needed. Base Case is satisfied.
</p>

<p>
let's assume it to be true for n=k
</p>

<p>
then 
</p>

<p>
F<sub>k+1</sub> = F<sub>k</sub> + F<sub>k-1</sub>
</p>

<p>
We know that binary F<sub>k</sub> = O(k) and binary F<sub>k-1</sub> = O(k-1)
</p>

<p>
It is already known that the maximum of n digit number on addition with itself will have n+1 digits.
</p>

<p>
e.g
</p>

<p>
1111111 + 1111111 = 11111110
</p>

<p>
Therefore k-digit binary number + k-1 digit binary number cannot produce more digits than k+1&#x2026;
</p>

<p>
Hence the statement is true for all fibonnacci numbers.
</p>

</div>
<ul class="org-ul">
<li>Since log n matrix multiplications are required, each compounding to 8 matrix multiplications. Running time will be nearly O(8M(n) log n) = O(M(n) log n)</li>
<li>Basically as we raise the power of the matrices, the length increases (doubles). Therefore</li>
</ul>
<p>
M(1) + M(2) + M(4)&#x2026; + M(n-1) = O(M(n))
Since the terms have some dependence on n (e.g. M(n-1)). 
</p>
</div>
</div>

<div id="outline-container-orgc14d83e" class="outline-3">
<h3 id="orgc14d83e"><span class="section-number-3">1.5</span> Extra</h3>
<div class="outline-text-3" id="text-1-5">
</div>
<div id="outline-container-orga294170" class="outline-4">
<h4 id="orga294170"><span class="section-number-4">1.5.1</span> Fibonnaci 1: By Recursion</h4>
<div class="outline-text-4" id="text-1-5-1">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #fe8019;">#include</span><span style="color: #b8bb26;">&lt;stdio.h&gt;</span>

<span style="color: #d3869b;">int</span> <span style="color: #fabd2f;">fib</span>(<span style="color: #d3869b;">int</span> <span style="color: #83a598;">n</span>)
{
  <span style="color: #fb4933;">if</span>(n == 0) <span style="color: #fb4933;">return</span> 0 ;
  <span style="color: #fb4933;">if</span>(n == 1) <span style="color: #fb4933;">return</span> 1;
  <span style="color: #fb4933;">else</span> <span style="color: #fb4933;">return</span> fib(n-1) + fib(n-2);  
}
<span style="color: #d3869b;">int</span> <span style="color: #fabd2f;">main</span>()
{
  printf(<span style="color: #b8bb26;">"%d"</span>, fib(40));
   <span style="color: #fb4933;">return</span> 0;
}
</pre>
</div>
<p>
Time: 0m1.143s
Note: if you have a linux machine, you can check the time on your machine by <code>time output-file</code>. but the time will be different on your machine.
</p>
</div>
</div>
<div id="outline-container-orgbef5a57" class="outline-4">
<h4 id="orgbef5a57"><span class="section-number-4">1.5.2</span> Fibonnaci 1: By Loop</h4>
<div class="outline-text-4" id="text-1-5-2">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #fe8019;">#include</span><span style="color: #b8bb26;">&lt;stdio.h&gt;</span>

<span style="color: #d3869b;">int</span> <span style="color: #fabd2f;">fib</span>(<span style="color: #d3869b;">int</span> <span style="color: #83a598;">n</span>)
{
  <span style="color: #fb4933;">if</span>(n == 0) <span style="color: #fb4933;">return</span> 0 ;
  <span style="color: #fb4933;">if</span>(n == 1) <span style="color: #fb4933;">return</span> 1;
  <span style="color: #d3869b;">int</span> <span style="color: #83a598;">Arr</span>[n];
  Arr[0] = 0; Arr[1] = 1;
  <span style="color: #fb4933;">for</span>(<span style="color: #d3869b;">int</span> <span style="color: #83a598;">i</span> = 2 ; i &lt; n; i++)
    Arr[i] = Arr[i-1] + Arr[i-2];
  <span style="color: #fb4933;">return</span> Arr[n-1] + Arr[n-2];
}
<span style="color: #d3869b;">int</span> <span style="color: #fabd2f;">main</span>()
{
  printf(<span style="color: #b8bb26;">"%d"</span>, fib(40));
   <span style="color: #fb4933;">return</span> 0;
}
</pre>
</div>
<p>
Time: 0m0.002s
</p>
</div>
</div>
