DasGuptaPapadimitriouVazirani.org
*** Fibonnaci 1: By Matrices
#+BEGIN_SRC c
#include<stdio.h>

int fib(int n)
{
  if(n == 0) return 0 ;
  if(n == 1) return 1;
  int mat[2][2] = {
    {0, 1},
    {1, 1}
}
  
}
int main()
{
  printf("%d", fib(40));
   return 0;
}
#+END_SRC
Time: 0m0.002s
#+LATEX: \mainmatter
* Algorithms with numbers
#+LATEX: \backmatter
* Code
#+BEGIN_SRC emacs-lisp
(add-to-list 'org-latex-classes
             '("some"
               "\\documentclass{book}"
               ("\\chapter{%s}" . "\\chapter*{%s}")
               ("\\section{%s}" . "\\section*{%s}")
               ("\\subsection{%s}" . "\\subsection*{%s}")
               ("\\subsubsection{%s}" . "\\subsubsection*{%s}")))
#+END_SRC
