DasGuptaPapadimitriouVazirani.tex
\subsection{Fibonnaci 1: By Matrices}
\label{sec:org2ae5ec1}
\begin{verbatim}
#include<stdio.h>

int fib(int n)
{
  if(n == 0) return 0 ;
  if(n == 1) return 1;
  int mat[2][2] = {
    {0, 1},
    {1, 1}
}

}
int main()
{
  printf("%d", fib(40));
   return 0;
}
\end{verbatim}
Time: 0m0.002s
\mainmatter
\chapter{Algorithms with numbers}
\label{sec:orgf565005}
\backmatter
\chapter{Code}
\label{sec:org93f8431}
\begin{verbatim}
(add-to-list 'org-latex-classes
             '("some"
               "\\documentclass{book}"
               ("\\chapter{%s}" . "\\chapter*{%s}")
               ("\\section{%s}" . "\\section*{%s}")
               ("\\subsection{%s}" . "\\subsection*{%s}")
               ("\\subsubsection{%s}" . "\\subsubsection*{%s}")))
\end{verbatim}
\end{document}
